NextFOAM-2606/tutorials/multiphase/interIsoFoam/iobasin/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1 0 0);

boundaryField
{
    inlet
    {
        type   flowRateInletVelocity;
        volumetricFlowRate constant 0.1;
    }

    walls
    {
        type   slip;
    }

    outlet
    {
        type   flowRateOutletVelocity;
        volumetricFlowRate constant 0.1;
    }

    atmosphere
    {
        type   pressureInletOutletVelocity;
        value  uniform (0 0 0);
    }
}


// ************************************************************************* //
